In [1]:
#1Run python -m pip install mysqlclient pymysql from your terminal to install the mysql client (any folder is fine)

In [2]:
#2 cd into your exercises folder for this module and run echo env.py >> .gitignore

In [3]:
#3Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
import pandas as pd
import numpy as np

In [5]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [7]:
def get_db_url(db):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [8]:
sql = '''
SELECT *
FROM employees
LIMIT 10
'''''

In [9]:
sql = '''
SELECT *
FROM employees
LIMIT 10
'''''

In [10]:
df = pd.read_sql(sql, get_db_url('employees'))

In [11]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [12]:
#4Use your function to obtain a connection to the employees database.

In [13]:
#5Once you have successfully run a query:

#-Intentionally make a typo in the database url. What kind of error message do you see?

#-Intentionally make an error in your SQL query. What does the error message look like?

In [14]:
#df2 = df = pd.read_sql(sql, get_db_url('employees'))

In [15]:
#6Read the employees and titles tables into two separate DataFrames.

sql_e = "SELECT * FROM employees"
sql_t = "SELECT * FROM titles"

In [16]:
df_e = pd.read_sql(sql_e, get_db_url('employees'))

In [17]:
df_t = pd.read_sql(sql_t, get_db_url('employees'))

In [18]:
df_e.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [19]:
df_e.shape

(300024, 6)

In [20]:
df_t.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [21]:
df_t.shape

(443308, 4)

In [22]:
#7How many rows and columns do you have in each DataFrame? Is that what you expected?

In [23]:
df_e.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [24]:
df_e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [25]:
df_t.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [26]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [27]:
#8Display the summary statistics for each DataFrame.

In [29]:
#9How many unique titles are in the titles DataFrame?
pd.read_sql('SELECT COUNT(DISTINCT title) AS unique_title_count FROM titles', url)

   unique_title_count
0                   7

In [30]:
df_t.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [31]:
df_t.title.nunique()

7

In [ ]:
#10What is the oldest date in the to_date column?

In [39]:
pd.read_sql('SELECT MIN(to_date) AS oldest_date FROM titles', url)

  oldest_date
0  1985-03-01

In [33]:
#11What is the most recent date in the to_date column?

In [40]:
df_t.to_date.max()

datetime.date(9999, 1, 1)